app/controllers/vehicles_controller.rb

  def create


    @vehicle = current_user.vehicles.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "vehicles" ("user_id", "brand", "model", "year", "created_at", "updated_at", "fuel_efficiency") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 4], ["brand", "231"], ["model", "Carro"], ["year", 1456], ["created_at", 2017-03-19 02:42:51 UTC], ["updated_at", 2017-03-19 02:42:51 UTC], ["fuel_efficiency", 1]]

  def update
    respond_to do |format|
      if @vehicle.update(vehicle_params)
---
UPDATE "vehicles" SET "brand" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?  [["brand", "Volkswageny"], ["updated_at", 2017-03-10 00:51:41 UTC], ["id", 1]]